src/test/resources/ws/getPerson.mustache

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:spr="http://springboottest-meetup.mufasa1976.github.io">
   <soapenv:Header/>
   <soapenv:Body>
      <spr:getPerson>
         <id>1</id>
      </spr:getPerson>
   </soapenv:Body>
</soapenv:Envelope>